# RoofArea_Total

## Description
Returns the total area along the slope of roofs or roof faces that meet the criteria.

```pascal
FUNCTION RoofArea_Total(c : CRITERIA) : REAL;
```

```python

def vs.RoofArea_Total(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
Availability: from Vectorworks 2009
## Category
* Criteria